from socket import socket, AF_INET, SOCK_STREAM, timeout

s = socket(AF_INET, SOCK_STREAM)
s.settimeout(5)
try:
    s.connect(("10.40.251.11", 50598))
   
    s.send(b"~\000\000\000x\23430\000\002\023#SCSC\006\026\206\340H\003\003N\206\342\222\304\242\022\275\244\304\022\207\324\344\214|\205\374\2644.\256\344\024\005\375\024\005\245d\253\230\362\314\274\202\324\324\"%\256\320\274\244\234\374\344l]\267\314\234T\005\335\200\304\222\fdy\030\255\227Z\221\252\304\0056RAI\t\267\n.\215\364\374\222|M\005#\273\274\322\034\0055\205\224\324\034\005%\325\2724\003%\000\214O2X")  # peer.txt with tcp://10.40.241.126
    
    print("\n正常にデータを送信しました。")
    s.close()
except timeout:
    print("接続がタイムアウトしました。")
except Exception as e:
    print(f"エラーが発生しました: {e}")